cases/constantCurrent_1D/0.org/C_H2O
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	C_H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 49805.49;

boundaryField
{
    topAndBottom 
    {
        type            empty;
    }
    
    currentCollector
    {
        type            zeroGradient;
    }

    separator
    {
        type            zeroGradient;
    }    
 
    frontAndBack 
    {
        type            empty;
    }
//    wall 
//    {
//        type            zeroGradient;
//    }    
}


// ************************************************************************* //
