cases/constantCurrent_1D/0.org/phiE
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	    phiE;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    topAndBottom 
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    currentCollector
    {
        type            calculatedGradient;
        value           uniform 0;
    }

    separator
    {
        //type            calculatedGradient;
        //value           uniform 0;
        type            fixedValue;
        value           uniform 0;
    }    
 
    frontAndBack 
    {
        type            empty;
    }
    wall 
    {
        type            fixedValue;
        value           uniform 0;
        //type            calculatedGradient;
        //value           uniform 0;
        //type            zeroGradient;
    }
}

// ************************************************************************* //
